= Neo4j from JavaScript
:level: Intermediate
:page-level: Intermediate
:author: Neo4j
:programming-language: javascript
:category: drivers
:tags: javascript, official-driver, app-development, applications
:description: If you are a JavaScript developer, this guide provides an overview of options for connecting to Neo4j.
// :page-ad-overline-link: https://graphacademy.neo4j.com/
// :page-ad-overline: Neo4j GraphAcademy
// :page-ad-title: Building Neo4j Applications with Node.js
// :page-ad-description: Learn how to interact with Neo4j from your Node.js app using the Neo4j Python Driver
// :page-ad-link: https://graphacademy.neo4j.com/courses/app-nodejs/
// :page-ad-underline: Learn more

.Goals
[abstract]
{description}
While this guide is not comprehensive it will introduce the different Drivers and link to the relevant resources.

include::./_includes/common-language-prereq.adoc[]

[role=expertise {level}]
{level}

[#neo4j-javascript]
== Neo4j for JavaScript Developers

image::{img}nodejs.png[float=right,width=300]

Neo4j provides drivers which allow you to make a connection to the database and develop applications
which create, read, update, and delete information from the graph.

You can use the official driver for JavaScript (neo4j-driver) or connect via HTTP using the `request` module or any of our community drivers.

[.discrete.ad]
== link:https://graphacademy.neo4j.com/?ref=guides[Learn with GraphAcademy^]

image::https://graphacademy.neo4j.com/courses/app-nodejs/badge/[float=left]

[.discrete]
=== link:https://graphacademy.neo4j.com/courses/app-nodejs/?ref=guides[Building Neo4j Applications with Node.js^]

In this free course, we walk through the steps to integrate Neo4j into your Node.js projects.
You will learn about the Neo4j JavaScript Driver, how sessions and transactions work and how to query Neo4j from an existing application.

link:https://graphacademy.neo4j.com/courses/app-nodejs/?ref=guides[Learn more^,role=button]


[#javascript-driver]
== Neo4j Javascript Driver

include::./_includes/javascript-driver.adoc[]

include::./_includes/sample_project.adoc[]

include::./_includes/community-driver-notice.adoc[]

[#js2neo-lib]
=== js2neo

As a demonstration of a minimal JavaScript based bolt driver, Nigel Small put together https://js2neo.org/[js2neo^].

[#js-http-endpoint]
== Using the HTTP-Endpoint directly

You can use something as simple as the `request` node-module to send queries to and receive responses from Neo4j.
The endpoint protocol and formats are explained in detail in the link:/docs/http-api/current/introduction/[Neo4j Manual^].
It enables you do to much more, e.g. sending many statements per request or keeping transactions open across multiple requests.

Here is a very simple example:

.Simple Function Accessing the Remote Endpoint
[source, javascript]
----
var r=require("request");
var txUrl = "http://localhost:7474/db/data/transaction/commit";
function cypher(query,params,cb) {
  r.post({uri:txUrl,
          json:{statements:[{statement:query,parameters:params}]}},
         function(err,res) { cb(err,res.body)})
}
----

.Running the Function
[source, javascript]
----
var query="MATCH (n:User) RETURN n, labels(n) as l LIMIT {limit}"
var params={limit: 10}
var cb=function(err,data) { console.log(JSON.stringify(data)) }

cypher(query,params,cb)

{"results":[
  {"columns":["n","l"],
   "data":[
     {"row":[{"name":"Aran"},["User"]]}
    ]
  }],
 "errors":[]}
----
